---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.SubregionOverlap
source: html/93bd1c88-4b43-4de8-f516-901da4b5a0e7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.SubregionOverlap Property

Highlighted sub-division overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId SubregionOverlap { get; }
```